src/toir_cf/src/Catalogs/торо_ОграниченияНаХарактеристикиОборудования/торо_ОграниченияНаХарактеристикиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ОграниченияНаХарактеристикиОборудования</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОграничений</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ГруппыХарактеристикОборудования</types>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.торо_ВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/InformationRegisters/торо_ОграниченияНаХарактеристикиОборудования/торо_ОграниченияНаХарактеристикиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОграниченияНаХарактеристикиОборудования</name>
  <dimensions>
    <name>ФункциональноеМесто</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ограничение</name>
    <type>
      <types>CatalogRef.торо_ОграниченияНаХарактеристикиОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Enums/торо_ВидыСравнения/торо_ВидыСравнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыСравнения</name>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Равно</name>
  </enumValues>
  <enumValues>
    <name>НеРавно</name>
  </enumValues>
  <enumValues>
    <name>ВИнтервале</name>
  </enumValues>
  <enumValues>
    <name>НеВИнтервале</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыОбъектовRCM</name>
  <enumValues>
    <name>Объект</name>
  </enumValues>
  <enumValues>
    <name>ФункциональноеМесто</name>
  </enumValues>
  <enumValues>
    <name>Система</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Catalogs/торо_ТиповыеОР/торо_ТиповыеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТиповыеОР</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.торо_ТипыОбъектовRCM</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.Производители</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствОР</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОРПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередаватьВАИСДиспетчер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативныйРемонт</name>
      <type>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособПланирования</name>
      <type>
        <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.торо_СтатусыНормативныхРемонтовИТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРемонтныхРабот</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособУчетаДатыОтсчета</name>
      <type>
        <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчаствуетВПланировании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
      <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПродолжительность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьПростоиОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РассчитыватьНаработкуВПростое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДатыЗамещающихРемонтов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредшествующиеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредшествующийВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамещаемыеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещаемыйВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗамещения</name>
      <type>
        <types>EnumRef.торо_СпособыЗамещенияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечнаяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеЗатратыПриТОиР</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОграниченияНаХарактеристикиОборудования</name>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>CatalogRef.торо_ОграниченияНаХарактеристикиОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктураИерархии</name>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_ОграниченияНаХарактеристикиОборудования/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.СписокОграничений.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Заполните список ограничений'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	НомерСтроки = 1;
	Для каждого Строка Из Объект.СписокОграничений Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Характеристика) Тогда 
			ШаблонСообщения = НСтр("ru = 'В строке %1 не заполнена характеристика!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НомерСтроки); 
			Поле = СтрШаблон("Объект.СписокОграничений[%1].Характеристика", Объект.СписокОграничений.Индекс(Строка));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.ВидСравнения) Тогда
			ШаблонСообщения = НСтр("ru = 'В строке %1 не заполнен вид сравнения!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НомерСтроки);   
			Поле = СтрШаблон("Объект.СписокОграничений[%1].ВидСравнения", Объект.СписокОграничений.Индекс(Строка));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.Значение) Тогда
			ШаблонСообщения = НСтр("ru = 'В строке %1 не заполнено значение характеристики!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НомерСтроки);       
			Поле = СтрШаблон("Объект.СписокОграничений[%1].Значение", Объект.СписокОграничений.Индекс(Строка));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	Если Модифицированность Тогда
		ДобавитьОбъектыДляПроверкиТребований();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОграничений
&НаКлиенте
Процедура СписокОграниченийХарактеристикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ВыбранноеЗначение = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		МассивНаборов = ПолучитьМассивНаборовСвойств();
		НовыйПараметр = Новый ПараметрВыбора("Отбор.НаборСвойств", МассивНаборов);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СписокОграниченийХарактеристика.ПараметрыВыбора = НовыеПараметры; 
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокОграниченийПередНачаломИзменения(Элемент, Отказ)
	УстановитьДоступностьКолонкиЗначений();
КонецПроцедуры

&НаКлиенте
Процедура СписокОграниченийХарактеристикаПриИзменении(Элемент)
	УстановитьДоступностьКолонкиЗначений();
КонецПроцедуры

&НаКлиенте
Процедура СписокОграниченийВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СписокОграничений.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		ЗаполнениеДанныхВыбораВидовСравнения(ТекДанные, СтандартнаяОбработка, ДанныеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОграниченийЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СписокОграничений.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекДанные.ВидСравнения) И (ТекДанные.ВидСравнения <> ПредопределенноеЗначение("Перечисление.торо_ВидыСравнения.НеРавно")  
			И ТекДанные.ВидСравнения <> ПредопределенноеЗначение("Перечисление.торо_ВидыСравнения.Равно"))
			И (ВыбранноеЗначение <> Тип("Число") ИЛИ Тип(ВыбранноеЗначение) <> Тип("Число")) Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Нечисловые значения характеристик доступны только для видов сравнений ""Равно"" или ""Не равно""!'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ДобавитьОбъектыДляПроверкиТребований()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ОграниченияНаХарактеристики.Ссылка КАК ФункциональноеМесто
	               |ИЗ
	               |	Справочник.торо_ТиповыеОР.ОграниченияНаХарактеристикиОборудования КАК торо_ОграниченияНаХарактеристики
	               |ГДЕ
	               |	торо_ОграниченияНаХарактеристики.Ограничение = &Ограничение
	               |	И торо_ОграниченияНаХарактеристики.Ссылка.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)";
	
	Запрос.УстановитьПараметр("Ограничение", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		торо_РаботаСФункциональнымиМестами.ДобавитьОбъектДляПроверки(Выборка.ФункциональноеМесто);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ОграниченияНаХарактеристикиОборудования.ФункциональноеМесто КАК ФункциональноеМесто
	               |ИЗ
	               |	РегистрСведений.торо_ОграниченияНаХарактеристикиОборудования КАК торо_ОграниченияНаХарактеристикиОборудования
	               |ГДЕ
	               |	торо_ОграниченияНаХарактеристикиОборудования.Ограничение = &Ограничение";
	
	Запрос.УстановитьПараметр("Ограничение", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		торо_РаботаСФункциональнымиМестами.ДобавитьОбъектДляПроверки(Выборка.ФункциональноеМесто);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеДанныхВыбораВидовСравнения(ТекДанные, СтандартнаяОбработка, ДанныеВыбора)

	Если ЗначениеЗаполнено(ТекДанные.Значение) И ТипЗнч(ТекДанные.Значение) <> Тип("Число") Тогда
		СтандартнаяОбработка = Ложь;
		СписокВидовСравнения = ПолучитьСписокВидовСравненияДляНечисловых();
		ДанныеВыбора = СписокВидовСравнения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВидовСравненияДляНечисловых()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.торо_ВидыСравнения.Равно, НСтр("ru = 'Равно'"));
	Список.Добавить(Перечисления.торо_ВидыСравнения.НеРавно, НСтр("ru = 'Не равно'"));
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьКолонкиЗначений()
	
	ТекДанные = Элементы.СписокОграничений.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Элементы.СписокОграниченийЗначение.ТолькоПросмотр = НЕ ЗначениеЗаполнено(ТекДанные.Характеристика);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивНаборовСвойств()
	
	МассивРодителей = Новый Массив;
	МассивРодителей.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_ОбъектыРемонта"));
	МассивРодителей.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_НаправленияОбъектовРемонтныхРабот"));
	МассивРодителей.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_ТиповыеОР"));
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.НаборСвойств КАК НаборСвойств
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.НаборСвойств.Родитель В (&МассивРодителей)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДополнительныеРеквизитыИСведения.НаборСвойств";
	
	Запрос.УстановитьПараметр("МассивРодителей", МассивРодителей);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("НаборСвойств");
	
КонецФункции

&НаКлиенте
Процедура СписокОграниченийХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(Элементы.СписокОграничений.ТекущиеДанные.Характеристика) = Тип("ПланВидовХарактеристикСсылка.торо_ГруппыХарактеристикОборудования") Тогда
		ОткрытьФорму("ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.ФормаВыбора",, Элементы.СписокОграниченийХарактеристика);
	ИначеЕсли ТипЗнч(Элементы.СписокОграничений.ТекущиеДанные.Характеристика) = Тип("ПланВидовХарактеристикСсылка.торо_ИзмеряемыеПоказателиОбъектовРемонта") Тогда
		ОткрытьФорму("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ФормаВыбора",, Элементы.СписокОграниченийХарактеристика);
	ИначеЕсли ТипЗнч(Элементы.СписокОграничений.ТекущиеДанные.Характеристика) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
		СтруктураПараметров.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
		СтруктураПараметров.Вставить("РазрешитьВыборКорня", Ложь);
		СтруктураПараметров.Вставить("РежимВыбора", Истина);
		МассивНаборов = ПолучитьМассивНаборовСвойств();
		СтруктураОтбора = Новый Структура("НаборСвойств", МассивНаборов);
		СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
		ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаВыбора", СтруктураПараметров, Элементы.СписокОграниченийХарактеристика);
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокОграниченийЗначениеПриИзменении(Элемент)
	Если НЕ ТипЗнч(Элементы.СписокОграничений.ТекущиеДанные.Характеристика) = Тип("ПланВидовХарактеристикСсылка.торо_ИзмеряемыеПоказателиОбъектовРемонта")
		И ТипЗнч(Элементы.СписокОграничений.ТекущиеДанные.Значение) = Тип("Число") Тогда		
		Элементы.СписокОграничений.ТекущиеДанные.Значение = Окр(Элементы.СписокОграничений.ТекущиеДанные.Значение,0);		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
